package com.yooli.demo.consts;

import java.util.HashMap;

/**
 * Created by lx on 2018/10/5.
 */
public enum  EnvBankGroupDef {
    交通银行("301","交通银行"),
    中信银行("302","中信银行"),
    中国光大银行("303","中国光大银行"),
    华夏银行("304","华夏银行"),
    中国民生银行("305","中国民生银行"),
    广发银行("306","广发银行"),
    平安银行("307","平安银行"),
    招商银行("308","招商银行"),
    兴业银行("309","兴业银行"),
    浦发银行("310","浦发银行"),
    恒丰银行("311","恒丰银行"),
    浙商银行("316","浙商银行"),
    渤海银行("317","渤海银行"),
    花旗银行("319","花旗银行"),
    东亚银行("320","东亚银行"),
    星展银行("324","星展银行"),
    友利银行("327","友利银行"),
    新韩银行("328","新韩银行"),
    韩亚银行("329","韩亚银行"),
    企业银行("336","企业银行"),
    中德银行("338","中德银行"),
    富邦华一银行("339","富邦华一银行"),
    微众银行("340","微众银行"),
    上海华瑞银行("343","上海华瑞银行"),
    重庆富民银行("346","重庆富民银行"),
    上海银行("401","上海银行"),
    厦门银行("402","厦门银行"),
    中国邮政储蓄银行("403","中国邮政储蓄银行"),
    烟台银行("404","烟台银行"),
    福建海峡银行("405","福建海峡银行"),
    吉林银行("406","吉林银行"),
    宁波银行("408","宁波银行"),
    齐鲁银行("409","齐鲁银行"),
    焦作中旅银行("411","焦作中旅银行"),
    温州银行("412","温州银行"),
    广州银行("413","广州银行"),
    汉口银行("414","汉口银行"),
    盛京银行("417","盛京银行"),
    洛阳银行("418","洛阳银行"),
    辽阳银行("419","辽阳银行"),
    大连银行("420","大连银行"),
    河北银行("422","河北银行"),
    杭州银行("423","杭州银行"),
    南京银行("424","南京银行"),
    东莞银行("425","东莞银行"),
    金华银行("426","金华银行"),
    乌鲁木齐银行("427","乌鲁木齐银行"),
    绍兴银行("428","绍兴银行"),
    成都银行("429","成都银行"),
    临商银行("431","临商银行"),
    葫芦岛银行("433","葫芦岛银行"),
    天津银行("434","天津银行"),
    郑州银行("435","郑州银行"),
    宁夏银行("436","宁夏银行"),
    珠海华润银行("437","珠海华润银行"),
    齐商银行("438","齐商银行"),
    锦州银行("439","锦州银行"),
    徽商银行("440","徽商银行"),
    重庆银行("441","重庆银行"),
    哈尔滨银行("442","哈尔滨银行"),
    贵阳银行("443","贵阳银行"),
    西安银行("444","西安银行"),
    丹东银行("446","丹东银行"),
    兰州银行("447","兰州银行"),
    南昌银行("448","南昌银行"),
    晋商银行("449","晋商银行"),
    青岛银行("450","青岛银行"),
    九江银行("454","九江银行"),
    日照银行("455","日照银行"),
    鞍山银行("456","鞍山银行"),
    青海银行("458","青海银行"),
    台州银行("459","台州银行"),
    长沙银行("461","长沙银行"),
    潍坊银行("462","潍坊银行"),
    赣州银行("463","赣州银行"),
    泉州银行("464","泉州银行"),
    营口银行("465","营口银行"),
    富滇银行("466","富滇银行"),
    阜新银行("467","阜新银行"),
    嘉兴银行("470","嘉兴银行"),
    廊坊银行("472","廊坊银行"),
    浙江泰隆商业银行("473","浙江泰隆商业银行"),
    内蒙古银行("474","内蒙古银行"),
    湖州银行("475","湖州银行"),
    沧州银行("476","沧州银行"),
    广西北部湾银行("478","广西北部湾银行"),
    包商银行("479","包商银行"),
    威海市商业银行("481","威海市商业银行"),
    攀枝花市商业银行("483","攀枝花市商业银行"),
    绵阳市商业银行("485","绵阳市商业银行"),
    泸州市商业银行("486","泸州市商业银行"),
    广东南粤银行("489","广东南粤银行"),
    张家口银行("490","张家口银行"),
    桂林银行("491","桂林银行"),
    龙江银行("492","龙江银行"),
    江苏长江商业银行("493","江苏长江商业银行"),
    柳州银行("495","柳州银行"),
    四川天府银行("496","四川天府银行"),
    莱商银行("497","莱商银行"),
    长城华西银行("498","长城华西银行"),
    唐山银行("499","唐山银行"),
    曲靖市商业银行("502","曲靖市商业银行"),
    晋城银行("503","晋城银行"),
    云南省农村信用社("509","云南省农村信用社"),
    承德银行("513","承德银行"),
    德州银行("515","德州银行"),
    邯郸银行("517","邯郸银行"),
    江苏银行("521","江苏银行"),
    云南红塔银行("524","云南红塔银行"),
    浙江民泰商业银行("525","浙江民泰商业银行"),
    上饶银行("526","上饶银行"),
    东营银行("527","东营银行"),
    泰安银行("528","泰安银行"),
    浙江稠州商业银行("530","浙江稠州商业银行"),
    乌海银行("531","乌海银行"),
    自贡银行("532","自贡银行"),
    鄂尔多斯银行("534","鄂尔多斯银行"),
    济宁银行("537","济宁银行"),
    乐山市商业银行("540","乐山市商业银行"),
    长安银行("541","长安银行"),
    重庆三峡银行("542","重庆三峡银行"),
    石嘴山银行("543","石嘴山银行"),
    昆仑银行("547","昆仑银行"),
    平顶山银行("548","平顶山银行"),
    朝阳银行("549","朝阳银行"),
    遂宁银行("551","遂宁银行"),
    保定银行("552","保定银行"),
    邢台银行("554","邢台银行"),
    晋中银行("559","晋中银行"),
    衡水银行("561","衡水银行"),
    宜宾市商业银行("564","宜宾市商业银行"),
    华融湘江银行("570","华融湘江银行"),
    营口沿海银行("572","营口沿海银行"),
    湖北银行("575","湖北银行"),
    广东华兴银行("578","广东华兴银行"),
    宁波通商银行("580","宁波通商银行"),
    甘肃银行("581","甘肃银行"),
    枣庄银行("582","枣庄银行"),
    贵州银行("584","贵州银行"),
    苏州银行("585","苏州银行"),
    中原银行("586","中原银行"),
    厦门国际银行("587","厦门国际银行"),
    海南银行("588","海南银行");

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    private String code;

    public String getBankName() {
        return bankName;
    }

    public void setBankName(String bankName) {
        this.bankName = bankName;
    }

    private String bankName;

    private EnvBankGroupDef(String code,String bankName){
        this.code=code;
        this.bankName=bankName;
    }
    public static HashMap<String,String> getEnumValueMap(){
        HashMap<String,String> map=new HashMap<String,String>();
        for (EnvBankGroupDef item:EnvBankGroupDef.values()){
            map.put(item.code,item.bankName);
        }
        return map;
    }

}
